=begin
**********************************************************************
Заполнить массив числами от 10 до 100 с шагом 5
**********************************************************************
=end

array = [] # Создать массив

index = 0   
delta = 5  # Шаг = 5
min = 10   # Начальное число
max =100   # Конечное число

num = min

while num <= max do
   array[index] = num
   index +=1
   num += delta
end
# Контрольный вывод на экран
#puts array  
puts "Массив с числами от 10 до 100 с шагом 5 содержит #{array.size.to_s} элементов:"
print "#{array} \n"
