=begin
**********************************************************************
Сделать хеш, содержащий месяцы и количество дней в месяце. В цикле выводить те месяцы, у которых количество дней ровно 30
**********************************************************************
=end

# Сделать хеш, содержащий месяцы и количество дней в месяце.
days = Hash.new 
  days["January"] = 31
  days["February"] = 28 
  days["March"] = 31 
  days["April"] = 30 
  days["May"] = 31 
  days["June"] = 30 
  days["July"] = 31 
  days["August"] = 31 
  days["September"] = 30 
  days["October"] = 31 
  days["November"] = 30 
  days["December"] = 31

# выводить те месяцы, у которых количество дней ровно 30
  days.each do |mount, days|
    puts "#{mount}" if days == 30
  end
